Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИдентификаторыТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4380d8c9-cbf4-44cf-b7c9-1da41ff5be61">
    <name>гкс_Обслуживание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67f4d7dd-7bf2-4031-a04a-7940d981637a">
    <name>гкс_Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/гкс_ИерархияТехКарт/гкс_ИерархияТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1778b732-7b72-4763-bf21-f5b833c5099c">
  <name>гкс_ИерархияТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c1b4ecf6-538b-4e3a-8191-5976b8c9f0dc">
    <name>Родитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="7148802b-6afa-4650-99b0-16fb73956331">
    <name>Подчиненный</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ)
	// гкс+ [] Деснол 16.08.2022
	//Если ЗначениеЗаполнено(Ссылка) Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	торо_ИдентификаторыТехКарт.Родитель КАК Родитель,
	//		|	гкс_ИерархияТехКарт.Родитель КАК Владелец,
	//		|	торо_ИдентификаторыТехКарт.ПометкаУдаления КАК ПометкаУдаления
	//		|ИЗ
	//		|	РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
	//		|		ПО гкс_ИерархияТехКарт.Подчиненный = торо_ИдентификаторыТехКарт.Ссылка
	//		|ГДЕ
	//		|	торо_ИдентификаторыТехКарт.Ссылка = &Ссылка
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	торо_ИдентификаторыТехКарт.ПометкаУдаления КАК ПометкаУдаления
	//		|ИЗ
	//		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
	//		|ГДЕ
	//		|	торо_ИдентификаторыТехКарт.Ссылка = &Ссылка";
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	РезультатЗапроса = Запрос.ВыполнитьПакет();
	//	Если РезультатЗапроса[0].Пустой() = Ложь Тогда 
	//		Выборка = РезультатЗапроса[0].Выбрать();
	//		Выборка.Следующий();
	//		Если Не Выборка.Родитель = Родитель	Тогда 
	//			Отказ = Истина;
	//			Сообщение = Новый СообщениеПользователю();
	//			Сообщение.Текст = НСтр("ru='Запрещено перемещать подчиненные тех карты!';
	//				|en='It is forbidden to move subordinates of standard maintenance plans!'");
	//			Сообщение.Сообщить();
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если РезультатЗапроса[1].Пустой() = Ложь Тогда 
	//		Выборка = РезультатЗапроса[1].Выбрать();
	//		Выборка.Следующий();
	//		Если Не Выборка.ПометкаУдаления = ПометкаУдаления Тогда 
	//			ДополнительныеСвойства.Вставить("ИзмененаПометкаУдаления", Истина);
	//		КонецЕсли;
	//	КонецЕсли;
	//ИначеЕсли ЭтоГруппа Тогда 		
		//ДополнительныеСвойства.Вставить("ЭтоНоваяГруппа", Истина);	
	//КонецЕсли;
	// гкс- [] Деснол 16.08.2022
КонецПроцедуры

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если Не Отказ Тогда 
		Если ДополнительныеСвойства.Свойство("ИзмененаПометкаУдаления") = Истина Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	гкс_ИерархияТехКарт.Подчиненный КАК Ссылка
				|ИЗ
				|	РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
				|ГДЕ
				|	гкс_ИерархияТехКарт.Родитель = &Ссылка
				|	И НЕ гкс_ИерархияТехКарт.Подчиненный.ПометкаУдаления = &ПометкаУдаления";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбъектИТК = Выборка.Ссылка.ПолучитьОбъект();
					ОбъектИТК.УстановитьПометкуУдаления(ПометкаУдаления);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		// гкс+ [12.22] Деснол 12.12.2022
		//Если Ложь И ДополнительныеСвойства.Свойство("ЭтоНоваяГруппа") = Истина Тогда 
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	Родитель1.Родитель КАК Родитель,
		//		|	Родитель1.Ссылка КАК Ссылка
		//		|ИЗ
		//		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК Родитель1
		//		|		ПО торо_ИдентификаторыТехКарт.Родитель = Родитель1.Ссылка
		//		|ГДЕ
		//		|	торо_ИдентификаторыТехКарт.Ссылка = &Родитель
		//		|;
		//		|
		//		|////////////////////////////////////////////////////////////////////////////////
		//		|ВЫБРАТЬ
		//		|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
		//		|	торо_ИдентификаторыТехКарт.гкс_Обслуживание КАК гкс_Обслуживание,
		//		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта,
		//		|	торо_ИдентификаторыТехКарт.гкс_Ответственный КАК гкс_Ответственный
		//		|ИЗ
		//		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		//		|		ПО торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты = торо_ИдентификаторыТехКарт.Ссылка
		//		|			И (торо_ИдентификаторыТехКарт.Статус = 
		//		|	ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует))
		//		|ГДЕ
		//		|	торо_ИдентификаторыТехКарт.Родитель = &Родитель
		//		|	И торо_ИдентификаторыТехКарт.ЭтоГруппа = ЛОЖЬ";
		//	
		//	Запрос.УстановитьПараметр("Родитель", Родитель);
		//	Запрос.УстановитьПараметр("Ссылка", Ссылка);          
		//	РезультатЗапроса = Запрос.ВыполнитьПакет();
		//	Если РезультатЗапроса[0].Пустой() = Ложь Тогда 
		//		НачатьТранзакцию();
		//		Попытка
		//			Выборка = РезультатЗапроса[0].Выбрать();
		//			Выборка.Следующий();
		//			Если Выборка.Родитель = Справочники.торо_ИдентификаторыТехКарт.ПустаяСсылка() Тогда 
		//				Если РезультатЗапроса[1].Пустой() = Ложь Тогда 
		//					Выборка = РезультатЗапроса[1].Выбрать();
		//					Пока Выборка.Следующий() Цикл
		//						Если ЗначениеЗаполнено(Выборка.ТехКарта) = Ложь Тогда 
		//							Продолжить;
		//						КонецЕсли;
		//						НовыйОбъект = Выборка.ТехКарта.Скопировать();
		//						НовыйОбъект.гкс_ШаблонОригинал = Выборка.ТехКарта;
		//						НовыйОбъект.Записать();
		//						
		//						НовыйИТК = Справочники.торо_ИдентификаторыТехКарт.СоздатьЭлемент();
		//						НовыйИТК.Наименование = Строка(Выборка.гкс_Обслуживание) + " " + Ссылка;
		//						НовыйИТК.гкс_Обслуживание = Выборка.гкс_Обслуживание;
		//						НовыйИТК.Родитель = Ссылка;
		//						НовыйИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
		//						НовыйИТК.гкс_Ответственный = Выборка.гкс_Ответственный;
		//						НовыйИТК.Записать();
		//						
		//						НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
		//						НаборЗаписей.Отбор.ИдентификаторТехКарты.Установить(НовыйИТК.Ссылка);
		//						НаборЗаписей.Отбор.Период.Установить(НовыйОбъект.ДатаПринятия);
		//						НоваяСтрока = НаборЗаписей.Добавить();
		//						НоваяСтрока.ИдентификаторТехКарты = НовыйИТК.Ссылка;
		//						НоваяСтрока.ТехКарта = НовыйОбъект.Ссылка;
		//						НоваяСтрока.Период = НовыйОбъект.ДатаПринятия;
		//						НаборЗаписей.Записать();
		//						
		//						НаборЗаписей = РегистрыСведений.гкс_ИерархияТехКарт.СоздатьНаборЗаписей();
		//						НаборЗаписей.Отбор.Подчиненный.Установить(НовыйИТК.Ссылка);
		//						НоваяСтрока = НаборЗаписей.Добавить();
		//						НоваяСтрока.Подчиненный = НовыйИТК.Ссылка;
		//						НоваяСтрока.Родитель = Выборка.Ссылка;
		//						НаборЗаписей.Записать();
		//					КонецЦикла;
		//				КонецЕсли;
		//			КонецЕсли;
		//		Исключение
		//			ОтменитьТранзакцию();
		//			Отказ = Истина;
		//			
		//		КонецПопытки;
		//		ЗафиксироватьТранзакцию();
		//	КонецЕсли;
		//	
		//КонецЕсли;
		// гкс- [12.22] Деснол 12.12.2022
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
